SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm22_synth.h
/* Bit fields for SYNTH DIVCTRL */
#define _SYNTH_DIVCTRL_RESETVALUE                     0x00000001UL                                /**< Default value for SYNTH_DIVCTRL             */
#define _SYNTH_DIVCTRL_MASK                           0x000001FFUL                                /**< Mask for SYNTH_DIVCTRL                      */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_SHIFT            0                                           /**< Shift value for SYNTH_LODIVFREQCTRL         */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_MASK             0x1FFUL                                     /**< Bit mask for SYNTH_LODIVFREQCTRL            */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_DEFAULT          0x00000001UL                                /**< Mode DEFAULT for SYNTH_DIVCTRL              */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV1           0x00000001UL                                /**< Mode LODIV1 for SYNTH_DIVCTRL               */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV2           0x00000002UL                                /**< Mode LODIV2 for SYNTH_DIVCTRL               */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV3           0x00000003UL                                /**< Mode LODIV3 for SYNTH_DIVCTRL               */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV4           0x00000004UL                                /**< Mode LODIV4 for SYNTH_DIVCTRL               */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV5           0x00000005UL                                /**< Mode LODIV5 for SYNTH_DIVCTRL               */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV7           0x00000007UL                                /**< Mode LODIV7 for SYNTH_DIVCTRL               */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV6           0x00000013UL                                /**< Mode LODIV6 for SYNTH_DIVCTRL               */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV8           0x00000014UL                                /**< Mode LODIV8 for SYNTH_DIVCTRL               */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV10          0x00000015UL                                /**< Mode LODIV10 for SYNTH_DIVCTRL              */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV14          0x00000017UL                                /**< Mode LODIV14 for SYNTH_DIVCTRL              */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV9           0x0000001BUL                                /**< Mode LODIV9 for SYNTH_DIVCTRL               */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV12          0x0000001CUL                                /**< Mode LODIV12 for SYNTH_DIVCTRL              */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV15          0x0000001DUL                                /**< Mode LODIV15 for SYNTH_DIVCTRL              */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV16          0x00000024UL                                /**< Mode LODIV16 for SYNTH_DIVCTRL              */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV20          0x00000025UL                                /**< Mode LODIV20 for SYNTH_DIVCTRL              */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV18          0x0000009BUL                                /**< Mode LODIV18 for SYNTH_DIVCTRL              */
#define _SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV24          0x0000009CUL                                /**< Mode LODIV24 for SYNTH_DIVCTRL              */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_DEFAULT           (_SYNTH_DIVCTRL_LODIVFREQCTRL_DEFAULT << 0) /**< Shifted mode DEFAULT for SYNTH_DIVCTRL      */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV1            (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV1 << 0)  /**< Shifted mode LODIV1 for SYNTH_DIVCTRL       */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV2            (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV2 << 0)  /**< Shifted mode LODIV2 for SYNTH_DIVCTRL       */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV3            (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV3 << 0)  /**< Shifted mode LODIV3 for SYNTH_DIVCTRL       */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV4            (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV4 << 0)  /**< Shifted mode LODIV4 for SYNTH_DIVCTRL       */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV5            (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV5 << 0)  /**< Shifted mode LODIV5 for SYNTH_DIVCTRL       */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV7            (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV7 << 0)  /**< Shifted mode LODIV7 for SYNTH_DIVCTRL       */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV6            (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV6 << 0)  /**< Shifted mode LODIV6 for SYNTH_DIVCTRL       */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV8            (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV8 << 0)  /**< Shifted mode LODIV8 for SYNTH_DIVCTRL       */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV10           (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV10 << 0) /**< Shifted mode LODIV10 for SYNTH_DIVCTRL      */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV14           (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV14 << 0) /**< Shifted mode LODIV14 for SYNTH_DIVCTRL      */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV9            (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV9 << 0)  /**< Shifted mode LODIV9 for SYNTH_DIVCTRL       */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV12           (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV12 << 0) /**< Shifted mode LODIV12 for SYNTH_DIVCTRL      */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV15           (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV15 << 0) /**< Shifted mode LODIV15 for SYNTH_DIVCTRL      */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV16           (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV16 << 0) /**< Shifted mode LODIV16 for SYNTH_DIVCTRL      */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV20           (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV20 << 0) /**< Shifted mode LODIV20 for SYNTH_DIVCTRL      */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV18           (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV18 << 0) /**< Shifted mode LODIV18 for SYNTH_DIVCTRL      */
#define SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV24           (_SYNTH_DIVCTRL_LODIVFREQCTRL_LODIV24 << 0) /**< Shifted mode LODIV24 for SYNTH_DIVCTRL      */

/* Bit fields for SYNTH CHCTRL */
#define _SYNTH_CHCTRL_RESETVALUE                      0x00000000UL                      /**< Default value for SYNTH_CHCTRL              */
#define _SYNTH_CHCTRL_MASK                            0x0000003FUL                      /**< Mask for SYNTH_CHCTRL                       */
#define _SYNTH_CHCTRL_CHNO_SHIFT                      0                                 /**< Shift value for SYNTH_CHNO                  */
#define _SYNTH_CHCTRL_CHNO_MASK                       0x3FUL                            /**< Bit mask for SYNTH_CHNO                     */
#define _SYNTH_CHCTRL_CHNO_DEFAULT                    0x00000000UL                      /**< Mode DEFAULT for SYNTH_CHCTRL               */
#define SYNTH_CHCTRL_CHNO_DEFAULT                     (_SYNTH_CHCTRL_CHNO_DEFAULT << 0) /**< Shifted mode DEFAULT for SYNTH_CHCTRL       */

/* Bit fields for SYNTH CHSP */
#define _SYNTH_CHSP_RESETVALUE                        0x00000000UL                      /**< Default value for SYNTH_CHSP                */
#define _SYNTH_CHSP_MASK                              0x0003FFFFUL                      /**< Mask for SYNTH_CHSP                         */
#define _SYNTH_CHSP_CHSP_SHIFT                        0                                 /**< Shift value for SYNTH_CHSP                  */
#define _SYNTH_CHSP_CHSP_MASK                         0x3FFFFUL                         /**< Bit mask for SYNTH_CHSP                     */
#define _SYNTH_CHSP_CHSP_DEFAULT                      0x00000000UL                      /**< Mode DEFAULT for SYNTH_CHSP                 */
#define SYNTH_CHSP_CHSP_DEFAULT                       (_SYNTH_CHSP_CHSP_DEFAULT << 0)   /**< Shifted mode DEFAULT for SYNTH_CHSP         */

/* Bit fields for SYNTH CALOFFSET */
#define _SYNTH_CALOFFSET_RESETVALUE                   0x00000000UL                              /**< Default value for SYNTH_CALOFFSET           */
#define _SYNTH_CALOFFSET_MASK                         0x00007FFFUL                              /**< Mask for SYNTH_CALOFFSET                    */
#define _SYNTH_CALOFFSET_CALOFFSET_SHIFT              0                                         /**< Shift value for SYNTH_CALOFFSET             */
#define _SYNTH_CALOFFSET_CALOFFSET_MASK               0x7FFFUL                                  /**< Bit mask for SYNTH_CALOFFSET                */
#define _SYNTH_CALOFFSET_CALOFFSET_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for SYNTH_CALOFFSET            */
#define SYNTH_CALOFFSET_CALOFFSET_DEFAULT             (_SYNTH_CALOFFSET_CALOFFSET_DEFAULT << 0) /**< Shifted mode DEFAULT for SYNTH_CALOFFSET    */

/* Bit fields for SYNTH VCOTUNING */
#define _SYNTH_VCOTUNING_RESETVALUE                   0x00008400UL                              /**< Default value for SYNTH_VCOTUNING           */
#define _SYNTH_VCOTUNING_MASK                         0x0000FFFFUL                              /**< Mask for SYNTH_VCOTUNING                    */
#define _SYNTH_VCOTUNING_VCOTUNING_SHIFT              0                                         /**< Shift value for SYNTH_VCOTUNING             */
#define _SYNTH_VCOTUNING_VCOTUNING_MASK               0x7FFUL                                   /**< Bit mask for SYNTH_VCOTUNING                */
#define _SYNTH_VCOTUNING_VCOTUNING_DEFAULT            0x00000400UL                              /**< Mode DEFAULT for SYNTH_VCOTUNING            */
#define SYNTH_VCOTUNING_VCOTUNING_DEFAULT             (_SYNTH_VCOTUNING_VCOTUNING_DEFAULT << 0) /**< Shifted mode DEFAULT for SYNTH_VCOTUNING    */
#define _SYNTH_VCOTUNING_VCAPSEL_SHIFT                11                                        /**< Shift value for SYNTH_VCAPSEL               */
#define _SYNTH_VCOTUNING_VCAPSEL_MASK                 0xF800UL                                  /**< Bit mask for SYNTH_VCAPSEL                  */
#define _SYNTH_VCOTUNING_VCAPSEL_DEFAULT              0x00000010UL                              /**< Mode DEFAULT for SYNTH_VCOTUNING            */
#define SYNTH_VCOTUNING_VCAPSEL_DEFAULT               (_SYNTH_VCOTUNING_VCAPSEL_DEFAULT << 11)  /**< Shifted mode DEFAULT for SYNTH_VCOTUNING    */

